Revit 2024 API
BuiltInFailures.SketchFailures.CannotComputeRailingsElevationWarn Property
 Can't compute Railings Elevation Profile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotComputeRailingsElevationWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotComputeRailingsElevationWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotComputeRailingsElevationWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace